---
kind: type
id: T:Autodesk.Revit.DB.PointRelativeToPoint
source: html/dbaeeb46-d0b2-5bbd-7a1c-2ad82920eeb6.htm
---
# Autodesk.Revit.DB.PointRelativeToPoint

Represents a point placed relative to another point.

## Syntax (C#)
```csharp
public class PointRelativeToPoint : PointElementReference
```

## Remarks
For this release, the only workflow supported is that the point is
 placed coincident with the referenced host (a relative transformation
 of Transform.Identity).